app/controllers/positions_controller.rb

SELECT "positions".* FROM "positions"
---
  def index
    @position_props = { open_positions: Position.all }